## Name: Manisha Chawla

## ID: P25CS002

## TPL616: Advanced Programming for DSAI

## Lab-4: Practice Problems (Pandas)

# Problems Set-2:

Use the Titanic dataset to solve the following tasks:

Step 1: Load Data

● Load the Titanic.csv file into a pandas DataFrame.

● Display dataset info, shape, and first 5 rows.

In [1]:
import pandas as pd
df_titanic = pd.read_csv('Titanic.csv')
print("Dataset Info:")
print(df_titanic.info())

Dataset Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.1+ KB
None

In [2]:
print("Dataset Shape:")
print(df_titanic.shape)

Dataset Shape:
(418, 11)

In [3]:
print("First 5 Rows:")
print(df_titanic.head())

First 5 Rows:
   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Cabin Embarked
0  34.5      0      0   330911   7.8292   NaN        Q
1  47.0      1      0   363272   7.0000   NaN        S
2  62.0      0      0   240276   9.6875   NaN        Q
3  27.0      0      0   315154   8.6625   NaN        S
4  22.0      1      1  3101298  12.2875   NaN        S

Step 2: Handle Missing Values

● Fill missing Age values with the median Age.

● Drop the Cabin column (too many missing values).

In [4]:
median_age = df_titanic['Age'].median()
df_titanic['Age'] = df_titanic['Age'].fillna(median_age)
df_titanic = df_titanic.drop(columns=['Cabin'])
print(df_titanic.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Embarked
0  34.5      0      0   330911   7.8292        Q
1  47.0      1      0   363272   7.0000        S
2  62.0      0      0   240276   9.6875        Q
3  27.0      0      0   315154   8.6625        S
4  22.0      1      1  3101298  12.2875        S

Step 3: Detect Outliers

● Detect outliers in the Fare column using:

1. Z-score method (|Z| > 3)

2. IQR method (outside [Q1 − 1.5×IQR, Q3 + 1.5×IQR])

● Create a new column Outlier_Fare = True/False

In [5]:
from scipy.stats import zscore
df_titanic['Fare_zscore'] = zscore(df_titanic['Fare'])
df_titanic['Outlier_Fare_Z'] = df_titanic['Fare_zscore'].abs() > 3
print(df_titanic.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Embarked  Fare_zscore  Outlier_Fare_Z
0  34.5      0      0   330911   7.8292        Q          NaN           False
1  47.0      1      0   363272   7.0000        S          NaN           False
2  62.0      0      0   240276   9.6875        Q          NaN           False
3  27.0      0      0   315154   8.6625        S          NaN           False
4  22.0      1      1  3101298  12.2875        S          NaN           False

In [6]:
# IQR method
Q1 = df_titanic['Fare'].quantile(0.25)
Q3 = df_titanic['Fare'].quantile(0.75)
IQR = Q3-Q1

lower_bound = Q1-1.5*IQR
upper_bound = Q3+1.5*IQR

df_titanic['Outlier_Fare_IQR']=(df_titanic['Fare'] < lower_bound) | (df_titanic['Fare'] > upper_bound)
print(df_titanic.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Embarked  Fare_zscore  Outlier_Fare_Z  \
0  34.5      0      0   330911   7.8292        Q          NaN           False
1  47.0      1      0   363272   7.0000        S          NaN           False
2  62.0      0      0   240276   9.6875        Q          NaN           False
3  27.0      0      0   315154   8.6625        S          NaN           False
4  22.0      1      1  3101298  12.2875        S          NaN           False

   Outlier_Fare_IQR
0             False
1             False
2             False
3             False
4             False

In [7]:
# Combine results into a single column
df_titanic['Outlier_Fare'] = df_titanic['Outlier_Fare_Z'] | df_titanic['Outlier_Fare_IQR']
df_titanic = df_titanic.drop(columns=['Fare_zscore'])
df_titanic = df_titanic.drop(columns=['Outlier_Fare_Z'])
df_titanic = df_titanic.drop(columns=['Outlier_Fare_IQR'])
print(df_titanic.head())

   PassengerId  Pclass                                          Name     Sex  \
0          892       3                              Kelly, Mr. James    male
1          893       3              Wilkes, Mrs. James (Ellen Needs)  female
2          894       2                     Myles, Mr. Thomas Francis    male
3          895       3                              Wirz, Mr. Albert    male
4          896       3  Hirvonen, Mrs. Alexander (Helga E Lindqvist)  female

    Age  SibSp  Parch   Ticket     Fare Embarked  Outlier_Fare
0  34.5      0      0   330911   7.8292        Q         False
1  47.0      1      0   363272   7.0000        S         False
2  62.0      0      0   240276   9.6875        Q         False
3  27.0      0      0   315154   8.6625        S         False
4  22.0      1      1  3101298  12.2875        S         False

In [8]:
print(df_titanic[['Fare', 'Outlier_Fare']].head(10))
print("\nNumber of Fare outliers:", df_titanic['Outlier_Fare'].sum())

      Fare  Outlier_Fare
0   7.8292         False
1   7.0000         False
2   9.6875         False
3   8.6625         False
4  12.2875         False
5   9.2250         False
6   7.6292         False
7  29.0000         False
8   7.2292         False
9  24.1500         False

Number of Fare outliers: 55

Step 4: Use a Pipeline

● Create functions:

○ handle_missing(df) → handles missing values

○ detect_outliers(df) → detects outliers in Fare

○ summarize(df) → returns average Age, average Fare, and survival
rate

● Apply them in a pipeline:

In [9]:
# handle missing values
def handle_missing(df):
    df['Age'] = df['Age'].fillna(df['Age'].median())
    if 'Cabin' in df.columns:
        df = df.drop(columns=['Cabin'])
    return df

# detect outliers in Fare
def detect_outliers(df):
    # Z-score method
    df['Fare_zscore'] = zscore(df['Fare'])
    df['Outlier_Fare_Z'] = df['Fare_zscore'].abs() > 3

    # IQR method
    Q1 = df['Fare'].quantile(0.25)
    Q3 = df['Fare'].quantile(0.75)
    IQR = Q3-Q1
    lower_bound = Q1-1.5*IQR
    upper_bound = Q3+1.5*IQR
    df['Outlier_Fare_IQR'] = (df['Fare'] < lower_bound) | (df['Fare'] > upper_bound)

    # Combine into one column
    df['Outlier_Fare'] = df['Outlier_Fare_Z'] | df['Outlier_Fare_IQR']
    df = df.drop(columns=['Fare_zscore'])
    df = df.drop(columns=['Outlier_Fare_Z'])
    df = df.drop(columns=['Outlier_Fare_IQR'])
    return df

# summarize key statistics
def summarize(df):
    avg_age = df['Age'].mean()
    avg_fare = df['Fare'].mean()
    summary = {
        'Average Age': avg_age,
        'Average Fare': avg_fare
    }
    return summary

In [10]:
# Apply pipeline
df_titanic = handle_missing(df_titanic)
df_titanic = detect_outliers(df_titanic)
summary_stats = summarize(df_titanic)
print("Summary Statistics:", summary_stats)

Summary Statistics: {'Average Age': np.float64(29.599282296650717), 'Average Fare': np.float64(35.627188489208635)}